21-auth/app/models/user.rb

    def self.all_sorted_by_answers
        User.all.sort do |user_a, user_b|
            user_b.answers.length <=> user_a.answers.length
---
SELECT "users".* FROM "users"
SELECT "answers".* FROM "answers" WHERE "answers"."user_id" = ?  [["user_id", 5]]