21-auth/app/controllers/answers_controller.rb

    def new
        @user = session[:user_id] ? User.find(session[:user_id]) : User.new
        @instructor = Instructor.all.sample
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "instructors".* FROM "instructors"

    def create
        question = Question.create({instructor_id: params[:answer][:instructor_id]})
        answer = Answer.create(answer_params)
        answer.question = question
        if answer.valid? && answer.user.valid?
            answer.save
---
INSERT INTO "answers" ("question_id", "cookie_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["question_id", 22], ["cookie_id", 1], ["created_at", "2019-05-27 13:37:09.937945"], ["updated_at", "2019-05-27 13:37:09.937945"], ["user_id", 1]]
INSERT INTO "questions" ("instructor_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["instructor_id", 41], ["created_at", "2020-02-28 10:36:29.193484"], ["updated_at", "2020-02-28 10:36:29.193484"]]
INSERT INTO "answers" ("question_id", "cookie_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["question_id", 16], ["cookie_id", 6], ["created_at", "2019-06-14 08:44:14.136583"], ["updated_at", "2019-06-14 08:44:14.136583"], ["user_id", 1]]
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "sam"], ["created_at", "2019-05-27 13:37:09.927598"], ["updated_at", "2019-05-27 13:37:09.927598"]]
INSERT INTO "answers" ("question_id", "cookie_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["question_id", 18], ["cookie_id", 39], ["created_at", "2020-02-28 10:36:29.226234"], ["updated_at", "2020-02-28 10:36:29.226234"], ["user_id", 4]]