21-auth/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_user
        @current_user = logged_in? ? User.find(session[:user_id]) : nil