21-auth/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?)  [["name", "SSSAM"], ["created_at", "2020-03-02 12:21:34.942575"], ["updated_at", "2020-03-02 12:21:34.942575"], ["password_digest", "$2a$12$2u78myySG1l2mJ35vjV/9.L37Li8rJpkWE7EO29YvZcXCIoQwGL0a"]]
---
    def create
        user = User.create(user_params)