21-auth/app/views/answers/new.html.erb

SELECT "users".* FROM "users"
SELECT  1 AS one FROM "users" LIMIT ?  [["LIMIT", 1]]
---
<% end %>
<% if !User.all.empty? && @current_user.admin %>

SELECT "answers".* FROM "answers" WHERE "answers"."user_id" = ?  [["user_id", 1]]
---
    <tbody>
        <% User.all_sorted_by_answers.each do |user| %>

SELECT "answers".* FROM "answers" WHERE "answers"."user_id" = ?  [["user_id", 1]]
---
                <td><%= user.name %></td>
                <td><%= user.answers.length %></td>